In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
df=pd.read_csv("age.csv")

In [4]:
df

   age   income
0   21   200000
1   22  3000000
2   23  5468454
3   24  5454516
4   25   654113
5   26  4684646
6   27  5611564

In [5]:
df.mean()

age            24.0
income    3581899.0
dtype: float64

In [6]:
df.median()

age            24.0
income    4684646.0
dtype: float64

In [7]:
df.mode()

   age   income
0   21   200000
1   22   654113
2   23  3000000
3   24  4684646
4   25  5454516
5   26  5468454
6   27  5611564

In [8]:
df.std()

age       2.160247e+00
income    2.336277e+06
dtype: float64

In [9]:
df.max()

age            27
income    5611564
dtype: int64

In [10]:
df.min()

age           21
income    200000
dtype: int64